INSERT INTO post(author_id, title, content)
VALUES(1, 'Искусственный нейрон',
'Искусственный нейрон - узел искусственной нейронной сети, являющийся упрощённой моделью естественного нейрона.
Математически, искусственный нейрон обычно представляют как некоторую нелинейную функцию от единственного аргумента —
линейной комбинации всех входных сигналов. Данную функцию называют функцией активации или функцией срабатывания,
передаточной функцией. Полученный результат посылается на единственный выход. Такие искусственные нейроны объединяют
в сети — соединяют выходы одних нейронов с входами других. Искусственные нейроны и сети являются основными элементами
идеального нейрокомпьютера.');

INSERT INTO post(author_id, title, content)
VALUES(1, 'Возобновляемые ресурсы',
'Возобновляемые ресурсы - природные ресурсы, запасы которых или восстанавливаются быстрее, чем используются,
или не зависят от того, используются они или нет. Это довольно расплывчатое определение, и часто в понятие
«возобновляемые ресурсы» включают не совсем то, что это словосочетание обозначает. Термин был введён в обращение
как противопоставление понятию «невозобновляемые ресурсы» (ресурсы, запасы которых могут быть исчерпаны уже в
ближайшее время при существующих темпах использования). Многие ресурсы, которые относят к возобновляемым, на самом деле
не восстанавливаются и когда-нибудь будут исчерпаны. В качестве примера можно привести солнечную энергию.
С другой стороны, при достаточном развитии технологии, многие ресурсы, которые традиционно считаются невозобновляемыми,
могут быть восстановлены. Например, металлы можно использовать повторно.
Ведутся исследования по переработке изделий из пластика.');

INSERT INTO post(author_id, title, content)
VALUES(1, 'Шанхайская башня',
'Шанхайская башня - сверхвысокое здание, строящееся в районе Пудун города Шанхай в Китае.
По завершении строительства это здание должно стать высочайшим в районе Пудун, опередив башню Цзинь Мао и Шанхайский
всемирный финансовый центр. Согласно проекту высота здания составит 634 метра, общая площадь — 380 тыс. м².
Предполагается, что по завершении строительства в 2014 году оно будет высочайшим зданием в Шанхае, первым по высоте
в Китае и третьим в мире свободно стоящим сооружением, обгоняя Небесное дерево Токио (632 м) но уступая Бурдж Халифа
(828 м) в Дубае, в 2015 году уступит первую китайскую и третью мировую позицию строящемуся
Международному финансовому центру Пинань в городе Шэньчжэнь, а после 2016 года станет 5-м в мире с учётом также
Башни Индия в Мумбаи.
3 августа 2013 года здание Шанхайской башни было достроено до уровня крыши. В августе 2014 были закончены внешние
работы и началась внутренняя отделка.');

INSERT INTO user(login, password, first_name, last_name, email) VALUES('User', 'User', 'User', 'User', 'User');